app/views/users/diaries/_diary_table.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."diary_id" = ?  [["diary_id", 1]]
---
        <div>
          コメント数 <%= diary.comments.count %>