app/views/users/diaries/_diary_form.html.erb

        <label>ペットを選択</label><br>
        <%= f.collection_select :pet_id, Pet.all, :id, :pet_name, include_blank: "選択して下さい" %>
---
SELECT "pets".* FROM "pets"