app/views/users/answers/_answer_table.html.erb

    <div class="col-12">
      <p class="mb-4">回答件数：<%= @question.answers.count %></p>
      <% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 2]]
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]