app/views/users/favorites/_favorite.html.erb

        <%= link_to diary_favorites_path(@diary), method: :delete do %>
          ♥<%= @diary.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."diary_id" = ?  [["diary_id", 9]]

        <%= link_to diary_favorites_path(@diary), method: :post do %>
          ♡<%= @diary.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."diary_id" = ?  [["diary_id", 9]]