app/views/users/comments/_comment_table.html.erb

    <div class="col-12">
      <p class="mb-4">コメント件数：<%= @diary.comments.count %></p>
      <% @diary.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."diary_id" = ?  [["diary_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."diary_id" = ?  [["diary_id", 3]]