app/controllers/users/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "answers" ("user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["question_id", 2], ["created_at", "2021-07-15 11:58:27.342048"], ["updated_at", "2021-07-15 11:58:27.342048"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(user_id: current_user.id, question_id: @question.id, answer_body: params[:answer_body])
    @answer.save