app/controllers/users/comments_controller.rb

  def create
    @diary = Diary.find(params[:diary_id])
    @comment = current_user.comments.new(comment_params)
    @comment.diary_id = @diary.id
    @comment.save
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "diary_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["diary_id", 7], ["comment", ""], ["created_at", "2021-07-17 19:34:38.188085"], ["updated_at", "2021-07-17 19:34:38.188085"]]

  def destroy
    Comment.find_by(id: params[:id], diary_id: params[:diary_id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."diary_id" = ? LIMIT ?  [["id", 7], ["diary_id", 1], ["LIMIT", 1]]