app/controllers/users/diaries_controller.rb

SELECT  "diaries".* FROM "diaries" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @diaries = Diary.page(params[:page]).reverse_order