app/controllers/users/diaries_controller.rb

  def index
    @diaries = Diary.all.order(" created_at DESC ")
---
SELECT "diaries".* FROM "diaries"

  def show
    @diary = Diary.find(params[:id])
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pet = Pet.find(params[:diary][:pet_id])
    @diary = @pet.diaries.build(diary_params)
    @diary.save
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2021-07-14 22:32:12.418667"], ["updated_at", "2021-07-14 22:32:12.418667"]]
INSERT INTO "diaries" ("pet_id", "diary_image_id", "diary_title", "diary_body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @diary = Diary.find(params[:id])
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def update
    @diary = Diary.find(params[:id])
    @diary.update(diary_params)
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "diaries" SET "diary_image_id" = ?, "updated_at" = ? WHERE "diaries"."id" = ?  [["diary_image_id", nil], ["updated_at", "2021-07-17 21:52:09.444774"], ["id", 9]]

  def destroy
    @diary = Diary.find(params[:id])
    @diary.destroy
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "diaries" WHERE "diaries"."id" = ?  [["id", 2]]