app/controllers/users/favorites_controller.rb

SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "diary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["diary_id", 9], ["created_at", "2021-07-17 22:05:14.681291"], ["updated_at", "2021-07-17 22:05:14.681291"]]
---
  def create
    diary = Diary.find(params[:diary_id])
    favorite = current_user.favorites.new(diary_id: diary.id)
    favorite.save