app/controllers/users/pets_controller.rb

INSERT INTO "pets" ("user_id", "image_id", "pet_name", "type_name", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet = current_user.pets.build(pet_params)
    if @pet.save

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "diaries".* FROM "diaries" WHERE "diaries"."pet_id" = ?  [["pet_id", 5]]
---
  def edit
    @pet = Pet.find(params[:id])
    @diaries = Diary.all.order(" created_at DESC ")

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pets" SET "image_id" = ?, "pet_name" = ?, "type_name" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["image_id", "c1e1748c3102aee3133faefc2967ddb0a8c722b912c47d82f3b078683541"], ["pet_name", "わさび"], ["type_name", "ふぇれっと"], ["updated_at", "2021-07-13 21:16:59.687107"], ["id", 2]]
---
  def update
    @pet = Pet.find(params[:id])
    if @pet.update(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]
---
  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy