app/controllers/users/pets_controller.rb

SELECT "pets".* FROM "pets"
---
  def index
    @user = current_user
    @pet = Pet.new
    @pets = @user.pets.page(params[:page]).reverse_order