app/controllers/users/questions_controller.rb

INSERT INTO "questions" ("user_id", "question_title", "question_body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["question_title", "換羽期について。"], ["question_body", "mmmmmmmmmmmmm"], ["created_at", "2021-07-15 16:26:26.789180"], ["updated_at", "2021-07-15 16:26:26.789180"]]
---
  def create
    @question = current_user.questions.build(question_params)
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "question_title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["question_title", "換羽期について。"], ["updated_at", "2021-07-15 05:35:26.155932"], ["id", 2]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy