app/controllers/users/questions_controller.rb

SELECT  "questions".* FROM "questions" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @questions = Question.page(params[:page]).reverse_order