app/controllers/users/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @pets = @user.pets.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-07-14 07:41:43.752081"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])
    @user = current_user
    @diary_new = Diary.all.order(' created_at DESC ')
    @tag_ranks = Tag.find(TagMiddle.group(:tag_id).order('count(tag_id) desc').limit(10).pluck(:tag_id))
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-07-13 23:33:22.368509"], ["id", 1]]
---
  def out
    @user = User.find(current_user.id)
    @user.update(is_deleted: true)